In [2]:
# DATA FRAMES are used for multidimensional data 
# we can also make data frames by combining two series 
# Series+ series = data Frame

In [4]:
import pandas as pd
import numpy as np

In [5]:
Series1= pd.Series([1,2,3,4,5])

In [6]:
Series2=pd.Series([6,7,8,9,10])

In [10]:
data={"series1":Series1,"series2":Series2}

In [11]:
df=pd.DataFrame(data)

In [12]:
df

   series1  series2
0        1        6
1        2        7
2        3        8
3        4        9
4        5       10

In [13]:
Dict={"Student":["Farhan","Asad","Daud","Javeria","Yashal","Arooj","Henry","Danis","Haris","Talha","Hannan","Ayesha"],
     "Age":[23,23,24,25,26,27,28,22,21,20,23,27],
     "CGPA":[2.3,4,3,2,2.4,2.5,3.3,3.9,2.4,2,2.5,3.9]}

In [60]:
new_df=pd.DataFrame(Dict)

In [63]:
new_df

    Student  Age  CGPA
0    Farhan   23   2.3
1      Asad   23   4.0
2      Daud   24   3.0
3   Javeria   25   2.0
4    Yashal   26   2.4
5     Arooj   27   2.5
6     Henry   28   3.3
7     Danis   22   3.9
8     Haris   21   2.4
9     Talha   20   2.0
10   Hannan   23   2.5
11   Ayesha   27   3.9

In [64]:
new_df.head()

   Student  Age  CGPA
0   Farhan   23   2.3
1     Asad   23   4.0
2     Daud   24   3.0
3  Javeria   25   2.0
4   Yashal   26   2.4

In [65]:
new_df.tail()

   Student  Age  CGPA
7    Danis   22   3.9
8    Haris   21   2.4
9    Talha   20   2.0
10  Hannan   23   2.5
11  Ayesha   27   3.9

In [66]:
new_df.columns

Index(['Student', 'Age', 'CGPA'], dtype='object')

In [67]:
new_df.index

RangeIndex(start=0, stop=12, step=1)

In [68]:
new_df.values

array([['Farhan', 23, 2.3],
       ['Asad', 23, 4.0],
       ['Daud', 24, 3.0],
       ['Javeria', 25, 2.0],
       ['Yashal', 26, 2.4],
       ['Arooj', 27, 2.5],
       ['Henry', 28, 3.3],
       ['Danis', 22, 3.9],
       ['Haris', 21, 2.4],
       ['Talha', 20, 2.0],
       ['Hannan', 23, 2.5],
       ['Ayesha', 27, 3.9]], dtype=object)

# How to Access data From df

In [69]:
new_df["CGPA"]

0     2.3
1     4.0
2     3.0
3     2.0
4     2.4
5     2.5
6     3.3
7     3.9
8     2.4
9     2.0
10    2.5
11    3.9
Name: CGPA, dtype: float64

In [70]:
ln=len(new_df)

In [71]:
ln

12

In [72]:
new_df["CGPA"].min()

2.0

In [73]:
new_df["CGPA"].max()

4.0

In [75]:
new_df["CGPA"].max()-new_df["CGPA"].min()

2.0

# Python List to DataFrame

In [76]:
list=[[1,2,3,4],[5,6,7,8],[9,10,11,12]]

In [77]:
df=pd.DataFrame(list,index=['ind_1','ind_2','ind_3'],columns=["A","B","C","D"])

In [78]:
df

       A   B   C   D
ind_1  1   2   3   4
ind_2  5   6   7   8
ind_3  9  10  11  12

In [79]:
df["A"]

ind_1    1
ind_2    5
ind_3    9
Name: A, dtype: int64

In [80]:
df[["A","D"]]

       A   D
ind_1  1   4
ind_2  5   8
ind_3  9  12

In [81]:
df["Country"]="Pakistan"  #For New Columns and give them value pakistan to Alll entries

In [82]:
df

       A   B   C   D   Country
ind_1  1   2   3   4  Pakistan
ind_2  5   6   7   8  Pakistan
ind_3  9  10  11  12  Pakistan

In [83]:
df

       A   B   C   D   Country
ind_1  1   2   3   4  Pakistan
ind_2  5   6   7   8  Pakistan
ind_3  9  10  11  12  Pakistan

In [84]:
new_df

    Student  Age  CGPA
0    Farhan   23   2.3
1      Asad   23   4.0
2      Daud   24   3.0
3   Javeria   25   2.0
4    Yashal   26   2.4
5     Arooj   27   2.5
6     Henry   28   3.3
7     Danis   22   3.9
8     Haris   21   2.4
9     Talha   20   2.0
10   Hannan   23   2.5
11   Ayesha   27   3.9

In [85]:
new_df["Status"]=["Pass" if CGPA>2.5 else "Fail" for CGPA in new_df["CGPA"]]

In [86]:
new_df

    Student  Age  CGPA Status
0    Farhan   23   2.3   Fail
1      Asad   23   4.0   Pass
2      Daud   24   3.0   Pass
3   Javeria   25   2.0   Fail
4    Yashal   26   2.4   Fail
5     Arooj   27   2.5   Fail
6     Henry   28   3.3   Pass
7     Danis   22   3.9   Pass
8     Haris   21   2.4   Fail
9     Talha   20   2.0   Fail
10   Hannan   23   2.5   Fail
11   Ayesha   27   3.9   Pass

In [87]:
new_df.shape

(12, 4)

In [88]:
new_df.ndim

2

In [98]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  12 non-null     object
 1   Age      12 non-null     int64
 2   CGPA     12 non-null     float64
 3   Status   12 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 512.0+ bytes

In [112]:
new_df.isnull().sum()

Student    0
Age        0
CGPA       0
Status     0
dtype: int64

In [113]:
new_df.notnull().sum()

Student    12
Age        12
CGPA       12
Status     12
dtype: int64

In [116]:
new_df.Student.dtype

dtype('O')

In [117]:
new_df.Student.astype("str")

0      Farhan
1        Asad
2        Daud
3     Javeria
4      Yashal
5       Arooj
6       Henry
7       Danis
8       Haris
9       Talha
10     Hannan
11     Ayesha
Name: Student, dtype: object